#ifndef HEADERS_TYPES_COMMON_MAP_H_
#define HEADERS_TYPES_COMMON_MAP_H_

struct trigger_spawn_nibbles {
    enum map_nibble trigger_00 : 4;
    enum map_nibble trigger_01 : 4;
    enum map_nibble trigger_02 : 4;
    enum map_nibble trigger_03 : 4;
    enum map_nibble trigger_04 : 4;
    enum map_nibble trigger_05 : 4;
    enum map_nibble trigger_06 : 4;
    enum map_nibble trigger_07 : 4;
    enum map_nibble trigger_08 : 4;
    enum map_nibble trigger_09 : 4;
    enum map_nibble trigger_10 : 4;
    enum map_nibble trigger_11 : 4;
    enum map_nibble trigger_12 : 4;
    enum map_nibble trigger_13 : 4;
    enum map_nibble trigger_14 : 4;
    enum map_nibble trigger_15 : 4;
    enum map_nibble trigger_16 : 4;
    enum map_nibble trigger_17 : 4;
    enum map_nibble trigger_18 : 4;
    enum map_nibble trigger_19 : 4;
    enum map_nibble trigger_20 : 4;
    enum map_nibble trigger_21 : 4;
    enum map_nibble trigger_22 : 4;
    enum map_nibble trigger_23 : 4;
    enum map_nibble trigger_24 : 4;
    enum map_nibble trigger_25 : 4;
    enum map_nibble trigger_26 : 4;
    enum map_nibble trigger_27 : 4;
    enum map_nibble trigger_28 : 4;
    enum map_nibble trigger_29 : 4;
    enum map_nibble trigger_30 : 4;
    enum map_nibble trigger_31 : 4;
    enum map_nibble trigger_32 : 4;
    enum map_nibble trigger_33 : 4;
    enum map_nibble trigger_34 : 4;
    enum map_nibble trigger_35 : 4;
    enum map_nibble trigger_36 : 4;
    enum map_nibble trigger_37 : 4;
    enum map_nibble trigger_38 : 4;
    enum map_nibble trigger_39 : 4;
    enum map_nibble trigger_40 : 4;
    enum map_nibble trigger_41 : 4;
    enum map_nibble trigger_42 : 4;
    enum map_nibble trigger_43 : 4;
    enum map_nibble trigger_44 : 4;
    enum map_nibble trigger_45 : 4;
    enum map_nibble trigger_46 : 4;
    enum map_nibble trigger_47 : 4;
};

ASSERT_SIZE(struct trigger_spawn_nibbles, 24);

struct pokemon_spawn_nibbles {
    enum map_nibble pokemon_00 : 4;
    enum map_nibble pokemon_01 : 4;
    enum map_nibble pokemon_02 : 4;
    enum map_nibble pokemon_03 : 4;
    enum map_nibble pokemon_04 : 4;
    enum map_nibble pokemon_05 : 4;
    enum map_nibble pokemon_06 : 4;
    enum map_nibble pokemon_07 : 4;
    enum map_nibble pokemon_08 : 4;
    enum map_nibble pokemon_09 : 4;
    enum map_nibble pokemon_10 : 4;
    enum map_nibble pokemon_11 : 4;
    enum map_nibble pokemon_12 : 4;
    enum map_nibble pokemon_13 : 4;
    enum map_nibble pokemon_14 : 4;
    enum map_nibble pokemon_15 : 4;
    enum map_nibble pokemon_16 : 4;
    enum map_nibble pokemon_17 : 4;
    enum map_nibble pokemon_18 : 4;
    enum map_nibble pokemon_19 : 4;
    enum map_nibble pokemon_20 : 4;
    enum map_nibble pokemon_21 : 4;
    enum map_nibble pokemon_22 : 4;
    enum map_nibble pokemon_23 : 4;
    enum map_nibble pokemon_24 : 4;
    enum map_nibble pokemon_25 : 4;
    enum map_nibble pokemon_26 : 4;
    enum map_nibble pokemon_27 : 4;
    enum map_nibble pokemon_28 : 4;
    enum map_nibble pokemon_29 : 4;
    enum map_nibble pokemon_30 : 4;
    enum map_nibble pokemon_31 : 4;
};

ASSERT_SIZE(struct pokemon_spawn_nibbles, 16);

struct npc_spawn_nibbles {
    enum map_nibble npc_00 : 4;
    enum map_nibble npc_01 : 4;
    enum map_nibble npc_02 : 4;
    enum map_nibble npc_03 : 4;
    enum map_nibble npc_04 : 4;
    enum map_nibble npc_05 : 4;
    enum map_nibble npc_06 : 4;
    enum map_nibble npc_07 : 4;
    enum map_nibble npc_08 : 4;
    enum map_nibble npc_09 : 4;
    enum map_nibble npc_10 : 4;
    enum map_nibble npc_11 : 4;
    enum map_nibble npc_12 : 4;
    enum map_nibble npc_13 : 4;
    enum map_nibble npc_14 : 4;
    enum map_nibble npc_15 : 4;
    enum map_nibble npc_16 : 4;
    enum map_nibble npc_17 : 4;
    enum map_nibble npc_18 : 4;
    enum map_nibble npc_19 : 4;
    enum map_nibble npc_20 : 4;
    enum map_nibble npc_21 : 4;
    enum map_nibble npc_22 : 4;
    enum map_nibble npc_23 : 4;
    enum map_nibble npc_24 : 4;
    enum map_nibble npc_25 : 4;
    enum map_nibble npc_26 : 4;
    enum map_nibble npc_27 : 4;
    enum map_nibble npc_28 : 4;
    enum map_nibble npc_29 : 4;
    enum map_nibble npc_30 : 4;
    enum map_nibble npc_31 : 4;
};

ASSERT_SIZE(struct npc_spawn_nibbles, 16);

struct target_destroyed_nibbles {
    enum map_nibble target_00 : 4;
    enum map_nibble target_01 : 4;
    enum map_nibble target_02 : 4;
    enum map_nibble target_03 : 4;
    enum map_nibble target_04 : 4;
    enum map_nibble target_05 : 4;
    enum map_nibble target_06 : 4;
    enum map_nibble target_07 : 4;
    enum map_nibble target_08 : 4;
    enum map_nibble target_09 : 4;
    enum map_nibble target_10 : 4;
    enum map_nibble target_11 : 4;
    enum map_nibble target_12 : 4;
    enum map_nibble target_13 : 4;
    enum map_nibble target_14 : 4;
    enum map_nibble target_15 : 4;
    enum map_nibble target_16 : 4;
    enum map_nibble target_17 : 4;
    enum map_nibble target_18 : 4;
    enum map_nibble target_19 : 4;
    enum map_nibble target_20 : 4;
    enum map_nibble target_21 : 4;
    enum map_nibble target_22 : 4;
    enum map_nibble target_23 : 4;
    enum map_nibble target_24 : 4;
    enum map_nibble target_25 : 4;
    enum map_nibble target_26 : 4;
    enum map_nibble target_27 : 4;
    enum map_nibble target_28 : 4;
    enum map_nibble target_29 : 4;
    enum map_nibble target_30 : 4;
    enum map_nibble target_31 : 4;
};

ASSERT_SIZE(struct target_destroyed_nibbles, 16);

struct unk_map_struct_size_0x80 {
    undefined4 field0_0x0;
    undefined field1_0x4;
    undefined field2_0x5;
    undefined field3_0x6;
    undefined field4_0x7;
    undefined field5_0x8;
    undefined field6_0x9;
    undefined field7_0xa;
    undefined field8_0xb;
    undefined field9_0xc;
    undefined field10_0xd;
    undefined field11_0xe;
    undefined field12_0xf;
    undefined field13_0x10;
    undefined field14_0x11;
    undefined field15_0x12;
    undefined field16_0x13;
    undefined field17_0x14;
    undefined field18_0x15;
    undefined field19_0x16;
    undefined field20_0x17;
    undefined field21_0x18;
    undefined field22_0x19;
    undefined field23_0x1a;
    undefined field24_0x1b;
    undefined field25_0x1c;
    undefined field26_0x1d;
    undefined field27_0x1e;
    undefined field28_0x1f;
    undefined field29_0x20;
    undefined field30_0x21;
    undefined field31_0x22;
    undefined field32_0x23;
    undefined field33_0x24;
    undefined field34_0x25;
    undefined field35_0x26;
    undefined field36_0x27;
    undefined field37_0x28;
    undefined field38_0x29;
    undefined field39_0x2a;
    undefined field40_0x2b;
    undefined field41_0x2c;
    undefined field42_0x2d;
    undefined field43_0x2e;
    undefined field44_0x2f;
    undefined field45_0x30;
    undefined field46_0x31;
    undefined field47_0x32;
    undefined field48_0x33;
    undefined field49_0x34;
    undefined field50_0x35;
    undefined field51_0x36;
    undefined field52_0x37;
    undefined field53_0x38;
    undefined field54_0x39;
    undefined field55_0x3a;
    undefined field56_0x3b;
    undefined field57_0x3c;
    undefined field58_0x3d;
    undefined field59_0x3e;
    undefined field60_0x3f;
    undefined field61_0x40;
    undefined field62_0x41;
    undefined field63_0x42;
    undefined field64_0x43;
    undefined field65_0x44;
    undefined field66_0x45;
    undefined field67_0x46;
    undefined field68_0x47;
    undefined field69_0x48;
    undefined field70_0x49;
    undefined field71_0x4a;
    undefined field72_0x4b;
    struct file_wrapper *map_script_file_wrapper;
    undefined4 field74_0x50;
    undefined1 field75_0x54;
    undefined field76_0x55;
    undefined field77_0x56;
    undefined field78_0x57;
    undefined field79_0x58;
    undefined field80_0x59;
    undefined field81_0x5a;
    undefined field82_0x5b;
    undefined field83_0x5c;
    undefined field84_0x5d;
    undefined field85_0x5e;
    undefined field86_0x5f;
    undefined field87_0x60;
    undefined field88_0x61;
    undefined field89_0x62;
    undefined field90_0x63;
    undefined field91_0x64;
    undefined field92_0x65;
    undefined field93_0x66;
    undefined field94_0x67;
    undefined field95_0x68;
    undefined field96_0x69;
    undefined field97_0x6a;
    undefined field98_0x6b;
    undefined field99_0x6c;
    undefined field100_0x6d;
    undefined field101_0x6e;
    undefined field102_0x6f;
    undefined field103_0x70;
    undefined field104_0x71;
    undefined field105_0x72;
    undefined field106_0x73;
    undefined field107_0x74;
    undefined field108_0x75;
    undefined field109_0x76;
    undefined field110_0x77;
    struct script_file *map_script_file;
    undefined4 field112_0x7c;
};
ASSERT_SIZE(struct unk_map_struct_size_0x80, 128);
#endif